public/programming/notes/ml/12-deep-generative-models.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">

</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../notes.html">Notes</a> &gt; <a href="intro-to-machine-learning.html">Intro to Machine Learning</a> &gt;
</p>

<div id="outline-container-orgd3e0d32" class="outline-2">
<h2 id="orgd3e0d32">Deep Generative Models</h2>
<div class="outline-text-2" id="text-orgd3e0d32">
</div>


<div id="outline-container-org22d872e" class="outline-3">
<h3 id="org22d872e">Definitions</h3>
<div class="outline-text-3" id="text-org22d872e">
</div>
<div id="outline-container-org2617e59" class="outline-4">
<h4 id="org2617e59">Generative Models</h4>
<div class="outline-text-4" id="text-org2617e59">
<p>
<span class="underline">Generative models</span> are statistical models of the data distribution
\(p_X\) or \(p_{XY}\), depending on the availability of target data, where
\(Y\) is the label variable.
</p>
</div>
</div>

<div id="outline-container-org7640a00" class="outline-4">
<h4 id="org7640a00">Discriminative models</h4>
<div class="outline-text-4" id="text-org7640a00">
<p>
<span class="underline">Discriminative models</span> are statistical models of the conditional
distribution \(p_{Y|X}\).
</p>

<p>
Note that a discriminative models can be constructed from a generative
model via Bayes rule but not viceversa.
</p>

<p>
\[p_{Y|X}(y|x)=\frac{p_{XY}(x, y)}{\sum_{y'}p_{XY}(x, y') = p_X(x)}\]
</p>
</div>
</div>
</div>

<div id="outline-container-orgc2e61a9" class="outline-3">
<h3 id="orgc2e61a9">Density Estimation</h3>
<div class="outline-text-3" id="text-orgc2e61a9">
<p>
Explicit problem: Find a probability distribution \(f\in \Delta (Z)\)
that fits the data, where \(z\in Z\) is sampled from an unknown data
distribution \(p_{data}\in \Delta (Z)\).
</p>

<p>
Implicit problem: Find a function \(f\in Z^{\Omega}\) that generates
data \(f(\omega)\in Z\) from an input \(w\) sampled from some predefined
distribution \(p_\omega \in \Delta (\Omega)\) in a way that the
distribution of generated samples fits the (unknown) data distribution
\(p_{data}\in \Delta (Z)\).
</p>

<p>
In the case of supervised learning, \(Z=X\times Y\) while in the case of
unsupervised learning, \(Z=X\). We will discuss this last case.
</p>

<p>
The objective is to define an hypothesis space \(H\subset \Delta (Z)\)
of models that can represent probability distributions and a
divergence measure \(d\in \mathbb{R}^{\Delta (z)\times \Delta (Z)}\)
between probability distributions in \(\Delta (Z)\). Then find the
hypothesis \(q*\in H\) that best fits the data distributed according to
\(p_{data}\):
</p>

<p>
\[q*\in arg\ min\ d_{q\in H}(p_{data}, q)\]
</p>
</div>

<div id="outline-container-orgfbaea6d" class="outline-4">
<h4 id="orgfbaea6d">KL-Divergence</h4>
<div class="outline-text-4" id="text-orgfbaea6d">
<p>
Before continuing, it is worth taking some time to study KL-divergence
since we will use this later. The Kullback–Leibler divergence, denoted
as \(d_{kl}(P|Q)\) is a type of statistical distance that measures how
much a model or theory probability distribution \(Q\) is different from
a true probability distribution \(P\). It is defined as:
</p>

<p>
\[d_{kl}(P|Q)=\sum_{x\in X}P(x)\log \frac{P(x)}{Q(x)}=\mathbb{E}[\log \frac{P(x)}{Q(x)}]\]
</p>

<p>
A simple interpretation of the KL divergence of \(P\) from \(Q\) is the
expected excess surprise from using \(Q\) as a model instead of \(P\) when
the actual distribution is \(P\). If \(P\) and \(Q\) are the same
distribution, the KL-divergence is \(0\).
</p>
</div>
</div>

<div id="outline-container-org45a4682" class="outline-4">
<h4 id="org45a4682">Jensen's Inequality</h4>
<div class="outline-text-4" id="text-org45a4682">
<p>
Jensen's inequality generalizes the definition of convex function as a
function that satisfies the following inequality:
</p>

<p>
\[f(\theta x_i + (1-\theta)x_2) \le \theta f(x_i)+(1-\theta)f(x_2)\]
</p>

<p>
In the context of probability theory, this is stated as:
</p>

<p>
\[\phi(\mathbb{E}[X])\le \mathbb{E}[\phi(X)]\]
</p>

<p>
where \(\phi\) is a convex function.
</p>
</div>
</div>
</div>

<div id="outline-container-org9bc82c1" class="outline-3">
<h3 id="org9bc82c1">Autoencoders</h3>
<div class="outline-text-3" id="text-org9bc82c1">
<p>
The basic idea behind autoencoders is to encode information (as in
compress) automatically, hence the name. Autoencoders are neural
network with the smallest layer at the center, and are symmetrical on
the left and right. We call the part of the network from the input to
the center an <span class="underline">encoder</span>, we call the other part a <span class="underline">decoder</span>. The
network can be trained with backpropagation by feeding input and
setting the error to be the difference between the input and what came
out.
</p>

<p>
The encoder can also be used for dimensionality reduction without the
encoder, or as a supervised model. It will reduce the input to a much
smaller latent space where another neural network can be connected to.
</p>
</div>
</div>

<div id="outline-container-org7a4dce9" class="outline-3">
<h3 id="org7a4dce9">Variational AutoEncoders (VAE)</h3>
<div class="outline-text-3" id="text-org7a4dce9">
<p>
Variational Autoencoders add a "probabilistic spin" to traditional
Autoencoders by finding a probability distribution in the latent space
and using this to decode another probabilistic distribution that best
matches the input's distribution.
</p>

<p>
Let \(\omega\) be the distribution in the <span class="underline">latent space</span>,
\(q_\theta(\omega|x)\) be an <span class="underline">encoder</span> distribution and
\(q_\theta(x|\omega)\) be a <span class="underline">decoder</span> distribution. Then the objective
is:
</p>

<p>
\[\theta^* \in arg\ min_{\theta \in \Theta}\ d(p_{data}, q_{\theta})\]
\[(1)\ q_\theta (x)=\mathbb{E}_{\omega \sim p^{\omega}}[q_\theta (x|\omega)]\]
</p>

<p>
The two formulas above are really important. We want to find the best
parameters that minimize the distance between the predicted \(q_\theta\)
distribution and the actual real distribution \(p_{data}\). We find
\(q_\theta(x)\) by taking the expected value of the decoder function
\(q_\theta(x|\omega)\) where \(\omega\) is the distribution in the latent
space.
</p>

<p>
As the divergence measure we will use the KL-Divergence:
</p>

<p>
\[d_{KL}(p_{data}, q_{\theta})=\mathbb{E}_{x\sim p_{data}}[\log \frac{p_{data}(x)}{q_{\theta (x)}}]=-\mathbb{E}_{x\sim p_{data}}[\log\ q_{\theta}(x)]+const\]
</p>

<p>
\[=^{(1)} -\mathbb{E}_{x\sim p_{data}}[\log\ \mathbb{E}_{\omega \sim p_{\omega}}[q_{\theta (x|\omega)}]]+const\]
</p>

<p>
Let's focus on the argument of the outer expected value. Let
\(q_\psi(\omega | x)\in \Delta (\Omega)\) denote an encoding probability
distribution with parameters \(\psi\). We can change the expected value
measure to this probability like this:
</p>

<p>
\[\log\ \mathbb{E}_{\omega \sim p_{\omega}}[q_{\theta} (x|\omega)]=\log\ \mathbb{E}_{\omega \sim q_\psi (\cdot|x)}[q_{\theta} (x|\omega)\frac{p_{\omega}(\omega)}{q_{\psi (\omega | x)}}]\]
</p>

<p>
Thanks to the Jensen's inequality we can write:
</p>

<p>
\[\ge \mathbb{E}_{\omega \sim q_\psi (\cdot|x)}[\log(q_{\theta}(x|\omega)\frac{p_{\omega}(\omega)}{q_{\psi (\omega | x)}})] =\]
\[=  \mathbb{E}_{\omega \sim q_\psi (\cdot|x)}[\log\ q_\theta (x|\omega)]-d_{KL}(q_\psi (\cdot|x), p_\omega)\]
</p>

<p>
Those two last terms are the <span class="underline">Reconstruction</span> and the
<span class="underline">Regularizer</span>. The first is still NP-hard to compute but we can
estimate the gradients of the parameters, while the regularizer might
have closed-form solution (for example, using Gaussian distribution).
</p>

<p>
In practice training is divided into several steps: first data samples
are fed to an encoder which can be something like a normal neural
network or a convolutional one. This encoder will reduce the
dimensionality of the input into what's called a "latent space" which
is composed of fewer nodes than the input layer. We are interested in
the distribution of this latent space, so we assume that its
distribution follows a gaussian and we compute the mean and the
covariance. We then feed this statistical model to the decoder which
generates again some data. Finally, we compare the original samples
with the generated data via a loss function and update the weights of
both the encoder and decoder to minimize the difference.
</p>
</div>
</div>

<div id="outline-container-orgac65786" class="outline-3">
<h3 id="orgac65786">Issues with VAE</h3>
<div class="outline-text-3" id="text-orgac65786">
<p>
The problem with this approach is underfitting, since at initial
stages the regularizer is too strong and tends to annihilate the model
capacity, and blurry output data.
</p>

<p>
A modern approach to image generation is Vector Quantized VAE
(VQ-VAE-2) which is a image synthesis model based on Variational
Autoencoders. It produces images that are high quality by leveraging a
<span class="underline">discrete latent space</span>.
</p>
</div>

<div id="outline-container-org1917d9c" class="outline-4">
<h4 id="org1917d9c">Conditional VAE</h4>
<div class="outline-text-4" id="text-org1917d9c">
<p>
Variatonal Auto Encoders do not need lables. Conditional VAE are a
variation of VAE that accept labels.
</p>

<p>
Assume we have side information \(y\in Y\) (e.g. digit labels,
attributes, etc) and we want to generate new data conditioned on the
side information (e.g. generate digit 7, or generate a face with
glasses).
</p>

<p>
Modify the encoder and decoder to take the side information in input
obtaining \(q_{\psi}(\omega | x, y)\) and \(q_{\theta}(x|\omega, y)\).
</p>

<p>
Define priors conditioned on side information \(p_{\omega}(\omega |y)\).
</p>
</div>
</div>
</div>

<div id="outline-container-org97a6c9e" class="outline-3">
<h3 id="org97a6c9e">Generative Adversial Networks (GAN)</h3>
<div class="outline-text-3" id="text-org97a6c9e">
<p>
VAE are able to find explicit densities, GAN enables the possibility
to find implicit ones.
</p>

<p>
GAN models are composed by two "adversarial" submodels: a <span class="underline">generator</span>
and a <span class="underline">discriminator</span>. The term adversarial means that the two
submodels are in competition and there is one winner (a zero sum
game).
</p>

<p>
The generator is tasked to generate fake images, while the
discriminator is tasked to recognize if an image is fake or not. The
generator generates images for the discriminator to check, mixing real
images with generated ones. If the generator fools the discriminator,
than the latter needs to update its weights, otherwise the opposite
will happen.
</p>

<p>
GANs enable the possibility of estimating implicit densities. We
assume to have a prior density \(p_\omega \in \Delta (\Omega)\) given
and a generator (or decoder) \(g_\theta \in X^{\Omega}\) that generates
data points in \(X\) given a random element from \(\Omega\).
</p>

<p>
The density induced by the prior \(p_{\omega}\) and the generator
\(g_{\theta}\) is given by \(q_{\theta}(x)=\mathbb{E}_{\omega \sim
p^{\omega}}\delta [g_\theta (\omega)-x]\), where \(\delta\) is the Dirac
delta function. The Dirac function is a generalized function on the
real numbers, whose value is zero everywhere except at zero, and whose
integral over the entire real line is equal to one.
</p>

<p>
The (original) GAN objective is to find \(\theta^*\) such that
\(q_{\theta^*}\) best fits the data distribution \(p_{data}\) under the
Jensen-Shannon divergence:
</p>

<p>
\[d_{JS}(P, Q)=\frac{1}{2}d_{kl}(P|M)+\frac{1}{2}d_{kl}(Q|M),\
M=\frac{1}{2}(P+Q)\] \[\theta^* \in arg\ min_{\theta}\
d_{JS}(p_{data}, q_{\theta})\]
</p>

<p>
where
</p>

<p>
\[d_{JS}(p, q)=\frac{1}{2}d_{KL}(p, \frac{p+q}{2})+\frac{1}{2}d_{KL}(q, \frac{p+q}{2})\]
\[=\frac{1}{2}\mathbb{E}_{x\sim p}[\log\frac{2p(x)}{p(x)+q(x)}]+\frac{1}{2}\mathbb{E}_{x\sim q}[\log\frac{2q(x)}{p(x)+q(x)}]\]
\[=\frac{1}{2}\mathbb{E}_{x\sim p}[\log\frac{p(x)}{p(x)+q(x)}]+\frac{1}{2}\mathbb{E}_{x\sim q}[\log\frac{q(x)}{p(x)+q(x)}] + \log(2)\]
\[=\log(2)+\frac{1}{2}max_t\ \{ \mathbb{E}_{x\sim p}[\log\ t(x)] + \mathbb{E}_{x\sim q}[\log(1-t(x))] \}\]
</p>

<p>
The interpretation of the \(JS\) divergence is that this mixes how the
two distributions depend on one another, not just one over the other;
it is useful when there is not a true reference distribution.
</p>

<p>
Let \(t_\phi (x)\) be a binary classifier (or discriminator) for data point in the training set predicting whether \(x\) came from \(p\) or \(q\), we get the following lower bound on our objective:
</p>

<p>
\[d_{JS}(p_{data}, q_\theta)=\log(2)+\frac{1}{2}max_t\ \{ \mathbb{E}_{x\sim p}[\log\ t(x)] + \mathbb{E}_{x\sim q}[\log(1-t(x))] \}\]
\[\ge \log(2)+\frac{1}{2}max_\phi \ \{ \mathbb{E}_{x\sim p}[\log\ t_\phi(x)] + \mathbb{E}_{x\sim q}[\log(1-t_\phi(x))] \}\]
</p>

<p>
Which is minimized to obtain the generator's parameters:
</p>

<p>
\[\theta^* \in argmin_\theta\ max_\phi \{ \mathbb{E}_{x\sim p}[\log\ t_\phi(x)] + \mathbb{E}_{x\sim q}[\log(1-t_\phi(g_{\theta}(x)))] \}\]
</p>

<p>
In practice, during training both real data and generated data are
passed to a classifier that estimates if the data is real or generated
with the \(t\phi(x)\) function. The generator and the discriminators are
opponents and this is modeled mathematically via the arg min-max
function: the generator tries to minimize the parameters \(\theta\) and
the classifier tries to maximize the parameter \(\phi\) to solve the
equation.
</p>

<hr />

<p>
Travel: <a href="intro-to-machine-learning.html">Intro to Machine Learning</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
